Documents/CRM_ЗаписьНаТестДрайв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>CRM_ЗаписьНаТестДрайв</Name>
			<BasedOn>
				<xr:Item>Document.CRM_КоммерческоеПредложение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CRM_ЗаписиНаТестДрайв</xr:Item>
				<xr:Item>InformationRegister.CRM_РезультатыКонтактов</xr:Item>
				<xr:Item>InformationRegister.CRM_ПроведенныйТестДрайв</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдатьНапоминание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КилометражНаКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КилометражНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаршрутыТестДрайва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказОтАнкетирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательНапоминания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыТестДрайва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТестДрайва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ТипыТестДрайвов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТопливоНаКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТопливоНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БУАвтомобиль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыКомментариев</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ПлановыеРезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CRM_ОценкаУдовлетворенностиКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СведенияКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СведенияКомпании</Name>
			<Comment>Некоторые сведения о компании которые могут измениться со временем (например гл. бухгалтер, руководитель...)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение сведения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:EnumRef.СтратегияСписанияПартийТоваровПоСтатусам</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:EnumRef.СтратегияСписанияПартийТоваровПоДатам</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Вид сведения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовСведений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_КлиентскиеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_КлиентскиеДанные</Name>
			<Comment>Черновая временная версия архитектуры</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредложенияИЗамечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыбораМарки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныВыбораМарки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаТекущегоАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаПредыдущегоАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантВЛице</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантПодпись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтказОтКонтакта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СогласиеНаПолучениеSMSДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Дополнительные характеристики автомобилей</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение дополнительного свойства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.ВидАвтомобиля</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КтоВнес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВнес</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗначения</Name>
					<Comment>Вид значения дополнительного свойства автомобиля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительнаяИнформацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/CRM_ЗаписьНаТестДрайв/Ext/ManagerModule.bsl
Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	Для Каждого ОбъектСсылка Из МассивДокументов Цикл
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ПолучитьДанныеОбъекта(ОбъектСсылка, ИмяМакета));
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	ОписаниеОбластей = Новый Соответствие;
	ОписаниеОбластей.Вставить(ИмяМакета, ПолучитьОписаниеОбластейМакетаОфисногоДокумента());
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
		Если ИмяМакета = "ПФ_DOC_ТестДрайвШаблон" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, Renault_УправлениеПечатью.ПолучитьМакет("Документ.CRM_ЗаписьНаТестДрайв.ПФ_DOC_ТестДрайвШаблон"));
			ТипыМакетов.Вставить(ИмяМакета, "DOC");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Данные, Макеты",
							ДанныеПоВсемОбъектам,
							Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
	
КонецФункции

Функция ПолучитьДанныеОбъекта(СсылкаНаОбъект, ИмяМакета)
	
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	
	Advanced = Renault_Привилегированный.ИспользуетсяФункционалAdvanced();
	
	Клиент = Объект.Клиент;
	Дата = Объект.ДатаПроведения;
	Автомобиль = Объект.Автомобиль;
	Модель = Объект.Автомобиль.Модель.Наименование;
	ГодВыпуска = Объект.Автомобиль;
	VIN = Объект.Автомобиль.VIN;
	НомерКузова = Объект.Автомобиль.НомерКузова;
	ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(СсылкаНаОбъект.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
	Цвет = Объект.Автомобиль.Цвет.Наименование;
	Начало = Объект.Начало;
	Окончание = Объект.Начало + Объект.Продолжительность*60;
	Менеджер = Объект.Менеджер.Наименование;
	Маршрут = Объект.Маршрут.Наименование;
	Продолжительность = ?(ЗначениеЗаполнено(Объект.Продолжительность),Формат(Объект.Продолжительность,"ЧЦ=3") + " мин.","");
	КилометражНаНачало = Объект.КилометражНаНачало;
	КилометражНаКонец = Объект.КилометражНаКонец;
	Пробег = КилометражНаКонец - КилометражНаНачало; 
	
	Организация = Справочники.Организации.ПустаяСсылка();
	ДЦ = Объект.ДилерскийЦентр;
	Если ЗначениеЗаполнено(ДЦ) Тогда
		Организация = Дц.Организация;
	Иначе
		ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
		Если ЗначениеЗаполнено(ДЦ) Тогда
			Организация = ДЦ.Организация;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеОбъекта = Новый Структура;
	
	Если Advanced Тогда
		ДанныеОбъекта.Вставить("Дата",			Строка(Формат(Дата, "ДФ=dd.MM.yyyy")));
	Иначе	
		ДанныеОбъекта.Вставить("Дата",			Строка(Формат(Дата, "ДФ='дд ММММ гггг'")));
	КонецЕсли;
	ДанныеОбъекта.Вставить("Модель",		Модель);
	ДанныеОбъекта.Вставить("Цвет",			Цвет);
	ДанныеОбъекта.Вставить("ГосНомер",		ГосНомер);
	ДанныеОбъекта.Вставить("НомерКузова",	НомерКузова);
	ДанныеОбъекта.Вставить("VIN",			VIN);
	ДанныеОбъекта.Вставить("Начало",		Формат(Начало, "ДФ=ЧЧ:мм"));
	ДанныеОбъекта.Вставить("Окончание",		Формат(Окончание, "ДФ=ЧЧ:мм"));		
	ДанныеОбъекта.Вставить("ФИОМенеджера",	Менеджер);
	ДанныеОбъекта.Вставить("Маршрут"	,	Маршрут);
	ДанныеОбъекта.Вставить("Продолжительность"	,	Продолжительность);		
	ДанныеОбъекта.Вставить("КилометражНаНачало",	КилометражНаНачало);
	ДанныеОбъекта.Вставить("КилометражНаКонец"	,	КилометражНаКонец);
	ДанныеОбъекта.Вставить("Пробег"	,	Пробег);
	
	Запрос = Новый Запрос;                
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаКлиентов.НаименованиеПолное,
	               |	ТаблицаКлиентов.Фамилия,
	               |	ТаблицаКлиентов.Имя,
	               |	ТаблицаКлиентов.Отчество,
	               |	ТаблицаКлиентов.ДатаРождения,
	               |	ТаблицаКлиентов.Пол,
	               |	CRM_КлиентскиеДанные.ПредложенияИЗамечания,
	               |	CRM_КлиентскиеДанные.ПричинаВыбораМарки,
	               |	CRM_КлиентскиеДанные.МаркаТекущегоАвтомобиля,
	               |	CRM_КлиентскиеДанные.МаркаПредыдущегоАвтомобиля,
	               |	CRM_КлиентскиеДанные.ДатаСоздания,
	               |	CRM_КлиентскиеДанные.ИсточникИнформации,
	               |	CRM_КлиентскиеДанные.Город,
	               |	КонтактнаяИнформация_ТелефонСотовый.Представление КАК ТелефонСотовый,
	               |	КонтактнаяИнформация_Email.Представление КАК ОсновнойEmail,
	               |	ПодтверждающиеДокументы_Паспорт.Серия КАК ПаспортСерия,
	               |	ПодтверждающиеДокументы_Паспорт.Номер КАК ПаспортНомер,
	               |	ПодтверждающиеДокументы_Паспорт.ДатаВыдачи КАК ПаспортДатаВыдачи,
	               |	ПодтверждающиеДокументы_Паспорт.КемВыдан КАК ПаспортКемВыдан,
	               |	ПодтверждающиеДокументы_ВУ.Серия КАК ВУСерия,
	               |	ПодтверждающиеДокументы_ВУ.Номер КАК ВУНомер,
	               |	ПодтверждающиеДокументы_ВУ.ДатаВыдачи КАК ВУДатаВыдачи,
	               |	ПодтверждающиеДокументы_ВУ.КемВыдан КАК ВУКемВыдано,
	               |	КонтактнаяИнформация_АдресФактический.Представление КАК АдресФактический,
	               |	КонтактнаяИнформация_АдресЮридический.Представление КАК АдресЮридический,
	               |	КонтактнаяИнформация_АдресЮридический.Представление КАК АдресПрописки,
	               |	ТаблицаКлиентов.ФормаСобственности,
	               |	ТаблицаКлиентов.ИНН,
	               |	ТаблицаКлиентов.КПП,
	               |	CRM_КлиентскиеДанные.ПодписантВЛице,
	               |	CRM_КлиентскиеДанные.ПодписантНаОсновании,
	               |	CRM_КлиентскиеДанные.ПодписантПодпись,
	               |	CRM_КлиентскиеДанные.ПодписантДолжность,
	               |	ТаблицаКлиентов.ОсновнойБанковскийСчет,
	               |	ТаблицаКлиентов.Наименование,
	               |	КонтактнаяИнформацияДилер_АдресФактический.Представление КАК ДилерАдресФактический,
	               |	КонтактнаяИнформацияДилер_АдресФактический.Поле4 КАК ДилерГород,
	               |	КонтактнаяИнформацияДилер_АдресЮридический.Представление КАК ДилерАдресЮридический,
	               |	КонтактнаяИнформацияДилер_Телефон.Представление КАК ДилерТелефон,
	               |	Организации.НаименованиеПолное КАК ДилерНаименованиеПолное,
	               |	Организации.ИНН КАК ДилерИНН,
	               |	Организации.КПП КАК ДилерКПП,
	               |	Организации.ОсновнойБанковскийСчет.Банк КАК ДилерБанк,
	               |	Организации.ОсновнойБанковскийСчет.Банк.Код КАК ДилерБИК,
	               |	Организации.ОсновнойБанковскийСчет КАК ДилерСчет,
	               |	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК ДилерКоррСчет,
	               |	Renault_ДопИнформацияПоВерсиям.МощностьКВТ,
	               |	Renault_ДопИнформацияПоВерсиям.МощностьЛС,
	               |	Renault_ДопИнформацияПоВерсиям.ОбъемДвигателя,
	               |	Renault_ДопИнформацияПоВерсиям.МинимальнаяМасса,
	               |	Renault_ДопИнформацияПоВерсиям.МаксимальнаяМасса,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.TypeTS КАК ТипТС,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.NaimProiz КАК Изготовитель,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.PTS_SERIE + "" "" + CRM_СостояниеАвтомобилейПроизводителя_v2.PTS_NUM КАК ПаспортТС,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.CategTS КАК КатегорияТС,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.YEAR КАК ГодВыпуска,
	               |	ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.MarkTS, Renault_ЗаявкаНаТрейдИн.ПроизводительКод) КАК Марка,
	               |	ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.ModelTS, Renault_ЗаявкаНаТрейдИн.МодельКод) КАК Модель,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.ENGINE_NUM КАК НомерДвигателя,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.NaimProiz КАК ОрганизацияИзготовительПТС,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.DATE_PTS КАК ДатаПТС,
	               |	CRM_ЗаписьНаТестДрайв.Начало КАК ВремяНачала,
	               |	CRM_ЗаписьНаТестДрайв.ДатаПроведения,
	               |	ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.VIN, Renault_ЗаявкаНаТрейдИн.VIN) КАК VIN,
	               |	Renault_ЗаявкаНаТрейдИн.ГосНомер,
	               |	Renault_ЗаявкаНаТрейдИн.НомерКузова,
	               |	Renault_ЗаявкаНаТрейдИн.Цвет,
	               |	СведенияКомпанииСрезПоследних.Значение КАК ДилерРуководитель,
	               |	Renault_ДоговорСоставДоговора.ПТС КАК ПТС,
	               |	Renault_ДоговорСоставДоговора.Ссылка.Дата КАК ДатаДоговора,
	               |	Renault_ДоговорСоставДоговора.Ссылка.Номер КАК НомерДоговора
	               |ИЗ
	               |	Документ.CRM_ЗаписьНаТестДрайв КАК CRM_ЗаписьНаТестДрайв
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияКомпании.СрезПоследних КАК СведенияКомпанииСрезПоследних
	               |			ПО Организации.Ссылка = СведенияКомпанииСрезПоследних.Организация
	               |				И (СведенияКомпанииСрезПоследних.Объект = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовСведений.Руководитель))
	               |		ПО (Организации.Ссылка = &Организация)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ПотенциальныеКонтрагенты КАК ТаблицаКлиентов
	               |		ПО CRM_ЗаписьНаТестДрайв.Клиент = ТаблицаКлиентов.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияДилер_АдресФактический
	               |		ПО (&Организация = КонтактнаяИнформацияДилер_АдресФактический.Объект)
	               |			И (КонтактнаяИнформацияДилер_АдресФактический.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресФактический))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияДилер_АдресЮридический
	               |		ПО (&Организация = КонтактнаяИнформацияДилер_АдресЮридический.Объект)
	               |			И (КонтактнаяИнформацияДилер_АдресЮридический.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮридический))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияДилер_Телефон
	               |		ПО (&Организация = КонтактнаяИнформацияДилер_Телефон.Объект)
	               |			И (КонтактнаяИнформацияДилер_Телефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	               |			И (КонтактнаяИнформацияДилер_Телефон.ЗначениеПоУмолчанию = ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_КлиентскиеДанные КАК CRM_КлиентскиеДанные
	               |		ПО (CRM_КлиентскиеДанные.Клиент = CRM_ЗаписьНаТестДрайв.Клиент)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация_ТелефонСотовый
	               |		ПО CRM_ЗаписьНаТестДрайв.Клиент = КонтактнаяИнформация_ТелефонСотовый.Объект
	               |			И (КонтактнаяИнформация_ТелефонСотовый.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	               |			И (КонтактнаяИнформация_ТелефонСотовый.ЗначениеПоУмолчанию = ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация_Email
	               |		ПО CRM_ЗаписьНаТестДрайв.Клиент = КонтактнаяИнформация_Email.Объект
	               |			И (КонтактнаяИнформация_Email.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	               |			И (КонтактнаяИнформация_Email.ЗначениеПоУмолчанию = ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы_Паспорт
	               |		ПО CRM_ЗаписьНаТестДрайв.Клиент = ПодтверждающиеДокументы_Паспорт.Владелец
	               |			И (ПодтверждающиеДокументы_Паспорт.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы_ВУ
	               |		ПО CRM_ЗаписьНаТестДрайв.Клиент = ПодтверждающиеДокументы_ВУ.Владелец
	               |			И (ПодтверждающиеДокументы_ВУ.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Удостоверение))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация_АдресЮридический
	               |		ПО CRM_ЗаписьНаТестДрайв.Клиент = КонтактнаяИнформация_АдресЮридический.Объект
	               |			И (КонтактнаяИнформация_АдресЮридический.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮридический))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация_АдресФактический
	               |		ПО CRM_ЗаписьНаТестДрайв.Клиент = КонтактнаяИнформация_АдресФактический.Объект
	               |			И (КонтактнаяИнформация_АдресФактический.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресФактический))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопИнформацияПоВерсиям КАК Renault_ДопИнформацияПоВерсиям
	               |		ПО CRM_ЗаписьНаТестДрайв.Автомобиль.ВариантКомплектации = Renault_ДопИнформацияПоВерсиям.ВариантКомплектации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	               |		ПО CRM_ЗаписьНаТестДрайв.Автомобиль.VIN = CRM_СостояниеАвтомобилейПроизводителя_v2.VIN
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_ЗаявкаНаТрейдИн КАК Renault_ЗаявкаНаТрейдИн
	               |		ПО CRM_ЗаписьНаТестДрайв.Автомобиль = Renault_ЗаявкаНаТрейдИн.Автомобиль
	               |			И (Renault_ЗаявкаНаТрейдИн.Статус = ЗНАЧЕНИЕ(Перечисление.Renault_CRM_СтатусЗаявокТрейдИн.ОформлениеЗавершено))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_Договор.СоставДоговора КАК Renault_ДоговорСоставДоговора
	               |		ПО CRM_ЗаписьНаТестДрайв.РабочийЛист = Renault_ДоговорСоставДоговора.Ссылка.РабочийЛист
	               |ГДЕ
	               |	CRM_ЗаписьНаТестДрайв.Ссылка = &ДокументСсылка";
				   
	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда			   
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "CRM_ПотенциальныеКонтрагенты", "Контрагенты");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;	
	Запрос.УстановитьПараметр("Ссылка", Клиент);
	Запрос.УстановитьПараметр("ДокументСсылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ДанныеОбъекта.Вставить("ФИОКлиента",		Выборка.НаименованиеПолное);
		ДанныеОбъекта.Вставить("Фамилия",			Выборка.Фамилия);
		ДанныеОбъекта.Вставить("Имя",				Выборка.Имя);
		ДанныеОбъекта.Вставить("Отчество",			Выборка.Отчество);
		ДанныеОбъекта.Вставить("Пол",				Выборка.Пол);
		
		ДанныеОбъекта.Вставить("ПаспортСерия",		Выборка.ПаспортСерия);
		ДанныеОбъекта.Вставить("ПаспортНомер",		Выборка.ПаспортНомер);
		ДанныеОбъекта.Вставить("ПаспортВыданКем",	Выборка.ПаспортКемВыдан);
		ДанныеОбъекта.Вставить("ПаспортВыданДата",	Формат(Выборка.ПаспортДатаВыдачи,"ДФ='дд.ММ.гггг'"));
		

		ДанныеОбъекта.Вставить("ВУСерия",			Выборка.ВУСерия);
		ДанныеОбъекта.Вставить("ВУНомер",			Выборка.ВУНомер);
		ДанныеОбъекта.Вставить("ВУКемВыдано",		Выборка.ВУКемВыдано);
		ДанныеОбъекта.Вставить("ВУДатаВыдачи",		Формат(Выборка.ВУДатаВыдачи,"ДФ='дд.ММ.гггг'"));
		
		ДанныеОбъекта.Вставить("АдресЮридический",	Выборка.АдресЮридический);
		ДанныеОбъекта.Вставить("АдресФактический",	Выборка.АдресФактический);
		ДанныеОбъекта.Вставить("АдресПрописки",		Выборка.АдресПрописки);
		ДанныеОбъекта.Вставить("ОсновнойТелефон",	Выборка.ТелефонСотовый);
		ДанныеОбъекта.Вставить("ТелефонСотовый",	Выборка.ТелефонСотовый);
		ДанныеОбъекта.Вставить("ОсновнойEmail",		Выборка.ОсновнойEmail);
		
		ДанныеОбъекта.Вставить("ДилерАдресФактический",		Выборка.ДилерАдресФактический);
		ДанныеОбъекта.Вставить("ДилерАдресЮридический",		Выборка.ДилерАдресЮридический);
		ДанныеОбъекта.Вставить("ДилерНаименованиеПолное",	Выборка.ДилерНаименованиеПолное);
		ДанныеОбъекта.Вставить("ДилерРуководитель",	Выборка.ДилерРуководитель);

		
		ДанныеОбъекта.Вставить("ДилерГород",		Выборка.ДилерГород);
		ДанныеОбъекта.Вставить("ДилерТелефон",		Выборка.ДилерТелефон);
		ДанныеОбъекта.Вставить("ДилерИНН",			Выборка.ДилерИНН);
		ДанныеОбъекта.Вставить("ДилерКПП",			Выборка.ДилерКПП);
		ДанныеОбъекта.Вставить("ДилерБанк",			Выборка.ДилерБанк);
		ДанныеОбъекта.Вставить("ДилерБИК",			Выборка.ДилерБИК);
		ДанныеОбъекта.Вставить("ДилерСчет",			Выборка.ДилерСчет);
		ДанныеОбъекта.Вставить("ДилерКоррСчет",		Выборка.ДилерКоррСчет);
		ДанныеОбъекта.Вставить("ОбъемДвигателя",	Выборка.ОбъемДвигателя);
		ДанныеОбъекта.Вставить("МинимальнаяМасса",	Выборка.МинимальнаяМасса);
		ДанныеОбъекта.Вставить("МаксимальнаяМасса",	Выборка.МаксимальнаяМасса);
		ДанныеОбъекта.Вставить("МощностьКВТ",		Выборка.МощностьКВТ);
		ДанныеОбъекта.Вставить("МощностьЛС",		Выборка.МощностьЛС);
		ДанныеОбъекта.Вставить("ТипТС",				Выборка.ТипТС);
		ДанныеОбъекта.Вставить("Изготовитель",		Выборка.Изготовитель);
		ДанныеОбъекта.Вставить("ПаспортТС",			Выборка.ПаспортТС);
		ДанныеОбъекта.Вставить("КатегорияТС",		Выборка.КатегорияТС);
		ДанныеОбъекта.Вставить("ОрганизацияИзготовительПТС",Выборка.ОрганизацияИзготовительПТС);
		ДанныеОбъекта.Вставить("ДатаПТС", 			Выборка.ДатаПТС);
		ДанныеОбъекта.Вставить("ГодВыпуска",		Выборка.ГодВыпуска);
		ДанныеОбъекта.Вставить("Марка",				Выборка.Марка);
		ДанныеОбъекта.Вставить("Модель",			Выборка.Модель);
		ДанныеОбъекта.Вставить("НомерДвигателя",	Выборка.НомерДвигателя);
		ДанныеОбъекта.Вставить("ДатаРождения",		Выборка.ДатаРождения);
		ДанныеОбъекта.Вставить("ВремяНачала",		Формат(Выборка.ВремяНачала,"ДФ=HH:MM"));
		ДанныеОбъекта.Вставить("ДатаПроведения",	Выборка.ДатаПроведения);
		ДанныеОбъекта.Вставить("VIN",				Выборка.VIN);
		ДанныеОбъекта.Вставить("ГосНомер",			?(ЗначениеЗаполнено(Выборка.ГосНомер),Выборка.ГосНомер, ГосНомер));
		ДанныеОбъекта.Вставить("НомерКузова",		Выборка.НомерКузова);
		ДанныеОбъекта.Вставить("Цвет",				Выборка.Цвет);
		
		ДанныеОбъекта.Вставить("ПТС",				Выборка.ПТС);
		ДанныеОбъекта.Вставить("НомерДоговора",		Выборка.НомерДоговора);
		ДанныеОбъекта.Вставить("ДатаДоговора",		Формат(Выборка.ДатаДоговора,"ДФ='дд.ММ.гггг'"));

	КонецЕсли;
		
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента()
	
	ОписаниеОбластей = Новый Структура;
	
	Renault_УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Заголовок", "Общая");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

Функция ЗаписьЗначенияРегистраСведения(Автомобиль, Значение,ВидЗначения,НаДату=Неопределено) Экспорт
	
	Отказ=Ложь;
	
	Если НаДату=Неопределено Тогда
		ДатаЗаписи=ТекущаяДата();
	Иначе
		ДатаЗаписи=НаДату;
	КонецЕсли; 
	
	Если ВидЗначения=Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег Тогда
		//При записи нового пробега
		//Получить последний пробег и следующий
		СтруктураОтбора=Новый Структура("Автомобиль,ВидЗначения", Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		СтруктураСведений=РегистрыСведений.Автомобили.ПолучитьПоследнее(Новый Граница(ДатаЗаписи,ВидГраницы.Исключая),СтруктураОтбора);
		Попытка ПробегДо = Число(СтруктураСведений.Значение); Исключение ПробегДо = 0; КонецПопытки;
		СтруктураСведений=РегистрыСведений.Автомобили.ПолучитьПервое(Новый Граница(ДатаЗаписи,ВидГраницы.Исключая),СтруктураОтбора);
		Попытка ПробегПосле = Число(СтруктураСведений.Значение); Исключение ПробегПосле = 9999999999; КонецПопытки;
		Если Значение<ПробегДо Тогда
			Сообщить("Значение пробега автомобиля не может быть менее старого значения ("+СокрЛП(ПробегДо)+").");
			Отказ=Истина; Возврат Отказ;
		КонецЕсли; 
		Если Значение>ПробегПосле Тогда
			Сообщить("Значение пробега автомобиля не может быть более следующего значения ("+СокрЛП(ПробегПосле)+").");
			Отказ=Истина; Возврат Отказ;
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		//Чтение старого значения регистра
		СтруктураОтбора = Новый Структура("Автомобиль,ВидЗначения", Автомобиль,ВидЗначения);
		СтруктураСведений = РегистрыСведений.Автомобили.ПолучитьПоследнее(ДатаЗаписи,СтруктураОтбора);
		ЗначениеСтарое    = СтруктураСведений.Значение;
		Записывать        = Ложь;
		//Введено значение, а старое отсутствует
		Если НЕ обЗначениеНеЗаполнено(Значение) И ЗначениеСтарое=Неопределено Тогда Записывать=Истина; КонецЕсли; 
		//Значение стерто, а старое значение было введено
		Если обЗначениеНеЗаполнено(Значение) И ЗначениеСтарое<>Неопределено Тогда Записывать=Истина; КонецЕсли; 
		//Введено значение и было введено старое
		Если НЕ обЗначениеНеЗаполнено(Значение) И ЗначениеСтарое<>Неопределено Тогда
			//Значение изменилось
			Если Значение<>ЗначениеСтарое Тогда Записывать=Истина; КонецЕсли; 
		КонецЕсли; 
		Если Записывать Тогда
			//Значение параметра изменилось
			ЗаписьРегСведений=РегистрыСведений.Автомобили.СоздатьМенеджерЗаписи();
			ЗаписьРегСведений.Автомобиль  = Автомобиль;
			ЗаписьРегСведений.ВидЗначения = ВидЗначения;
			ЗаписьРегСведений.Значение    = Значение;
			ЗаписьРегСведений.Период      = ДатаЗаписи;
			Попытка
				ЗаписьРегСведений.Записать();
			Исключение
				Сообщить("Ошибка записи параметра автомобиля в регистр сведений");
				Отказ=Истина;
			КонецПопытки; 
		КонецЕсли; 
	КонецЕсли; 
		
	Возврат Отказ;
КонецФункции // ЗаписьЗначенияРегистраСведения()
